app/views/orders/report.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <tr>
            <td><%= Product.where(id: k).take.name %></td>