app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
      @orders = Order.all

SELECT "products".* FROM "products"
---
  def new
      @order = Order.new
      @customer = Customer.new
      @products = Product.all

INSERT INTO "customers" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Minh Quy"], ["phone", "356125874"], ["created_at", "2020-02-26 07:37:54.720486"], ["updated_at", "2020-02-26 07:37:54.720486"]]
INSERT INTO "orders" ("created_at", "updated_at", "customer_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-02-26 08:34:45.569223"], ["updated_at", "2020-02-26 08:34:45.569223"], ["customer_id", 1]]
---
    respond_to do |format|
      if @customer.valid?
        if @order.valid?
          @remained_lists = CreateOrderService.new(customer_params, order_params).create

SELECT SUM("order_details"."quantity") AS sum_quantity, "order_details"."product_id" AS order_details_product_id FROM "order_details" WHERE "order_details"."created_at" BETWEEN $1 AND $2 GROUP BY "order_details"."product_id" ORDER BY sum_quantity DESC  [["created_at", "2020-03-01 00:00:00"], ["created_at", "2020-03-03 00:00:00"]]
---
  def report
      @lists = OrderDetail.where(created_at: params[:start_date]..params[:end_date])
      .group(:product_id).order('sum_quantity DESC').sum(:quantity).first(2).to_h