app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
	def index
		@products = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "aaaaa"], ["price", 1.0], ["created_at", "2020-03-04 07:07:58.609112"], ["updated_at", "2020-03-04 07:07:58.609112"]]
---
  	def create
    	# check validation in controller
		@product = Product.new(product_params)
		respond_to do |format|
		if @product.valid?
			#???????
    	    flag = CreateProductService.new(product_params).create

SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY "products"."id" DESC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	def edit
		@product = Product.where(id: params[:id].to_i).last

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Rau Cao"], ["updated_at", "2020-03-04 08:42:03.341290"], ["id", 5]]
---
  def update
    @product = Product.find(params[:id])
    # UpdateProductService.new(params[:id].to_i, product_params).update
    	respond_to do |format|
    	  if @product.update(product_params)

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Kem"], ["price", 16000.0], ["created_at", "2020-03-06 07:13:07.170075"], ["updated_at", "2020-03-06 07:13:07.170075"]]
---
  def create_product
    @form = NewProductForm.new(new_product_params)
    respond_to do |format|
      if @form.valid?
        @form = CreateProductFormService.new(new_product_params).create