app/services/order_services/create_order_service.rb

SELECT "inventories".* FROM "inventories" WHERE (product_id = '1' AND quantity >= '0') LIMIT $1  [["LIMIT", 1]]
SELECT "inventories".* FROM "inventories" WHERE (product_id = '1' AND quantity >= 'a') LIMIT $1  [["LIMIT", 1]]
---
    def check_inventory
        #if remained_lists not null thi` vuot qua so luong roll back
        remained_lists = []
        @order_params["order_details_attributes"].each do |k, v|

            array = @order_params["order_details_attributes"][k].values
            if array[1].to_i == 0
                return check_valid(@order_params["order_details_attributes"][k])
            end
            temp = Inventory.where("product_id = ? AND quantity >= ?", array[0], array[1]).take

            rescue Exception => e
                return check_valid(@order_params["order_details_attributes"][k])
            else
            if temp.nil?
                inv = Inventory.where(product_id: array[0])

SELECT "products".* FROM "products" WHERE (id = '1') LIMIT $1  [["LIMIT", 1]]
---
    def merge_params
        @order_params["order_details_attributes"].each do |k, v|
            product_id_arr = @order_params["order_details_attributes"][k].to_unsafe_h.first
            price_hash = Product.find_by("id = ?", product_id_arr[1]).attributes.slice('price')

SELECT "inventories".* FROM "inventories" WHERE (product_id = '1') LIMIT $1  [["LIMIT", 1]]
UPDATE "inventories" SET "quantity" = $1, "updated_at" = $2 WHERE "inventories"."id" = $3  [["quantity", 890], ["updated_at", "2020-03-05 07:44:14.124716"], ["id", 1]]
---
    def update_inventory
        @order_params["order_details_attributes"].each do |k, v|
            array = @order_params["order_details_attributes"][k].values
            enventory = Inventory.find_by("product_id = ?", array[0])
            enventory.update_attributes(quantity: (enventory.quantity - array[1].to_i))

SELECT "customers".* FROM "customers" WHERE (phone = '0396162108') LIMIT $1  [["LIMIT", 1]]
INSERT INTO "customers" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "vuongph"], ["phone", "0987898768"], ["created_at", "2020-03-04 09:16:43.701019"], ["updated_at", "2020-03-04 09:16:43.701019"]]
INSERT INTO "orders" ("created_at", "updated_at", "customer_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-03-05 07:44:13.671650"], ["updated_at", "2020-03-05 07:44:13.671650"], ["customer_id", 1]]
---
    def create
        error_lists = check_inventory
        if error_lists.blank?
            @customer = Customer.where("phone = ?", @cus_params[:phone]).take
            if !@customer.present?
                @customer_new = Customer.new(@cus_params)
                @customer_new.save
                @customer = @customer_new
            end

            merge_params

            temp = @order_params.merge(:customer_id => @customer.id)

            @order = Order.new(temp)
            if @order.save