app/services/product_services/create_product_service.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Xa Xiu"], ["price", 20000.0], ["created_at", "2020-02-21 07:00:28.610745"], ["updated_at", "2020-02-21 07:00:28.610745"]]
INSERT INTO "inventories" ("product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 4], ["quantity", 0], ["created_at", "2020-02-21 06:58:59.326413"], ["updated_at", "2020-02-21 06:58:59.326413"]]
---
		def create
			#params ok roi
			@product = Product.new(name: params[:name],price: params[:price])
			if @product.save
				@inventory = Inventory.new(product: @product, quantity: 0)
				@inventory.save