app/services/product_services/create_product_form_service.rb

    def create
        product = Product.create(name: params[:name], price: params[:price])
        product.create_inventory(product: product, quantity: params[:quantity])
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Banh Bao Khoai Mon"], ["price", 6000.0], ["created_at", "2020-03-06 07:22:55.430531"], ["updated_at", "2020-03-06 07:22:55.430531"]]
INSERT INTO "inventories" ("product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 26], ["quantity", 101], ["created_at", "2020-03-06 07:31:17.867947"], ["updated_at", "2020-03-06 07:31:17.867947"]]