app/services/product_services/update_product_service.rb

        def update
            @product = Product.find(id)
            if @product
                if @product.update(params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", ""], ["price", nil], ["updated_at", "2020-03-02 08:31:45.833321"], ["id", 4]]